Revit 2027 API
DWFExportOptions.ImageQuality Property
Image quality level when compressed raster format(JPEG) is used.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DWFImageQuality ImageQuality { get; set; }
Public Property ImageQuality As DWFImageQuality
	Get
	Set
public:
property DWFImageQuality ImageQuality {
	DWFImageQuality get ();
	void set (DWFImageQuality value);
}
member ImageQuality : DWFImageQuality with get, set
Property Value
DWFImageQuality
Remarks
The default value is Default.
See Also
Reference
DWFExportOptions Class
Autodesk.Revit.DB Namespace